In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Titanic.csv')

In [3]:
df.head()

      sex   age  sibsp  parch     fare embarked  class    who  alone  survived
0    male  22.0      1      0   7.2500        S  Third    man  False         0
1  female  38.0      1      0  71.2833        C  First  woman  False         1
2  female  26.0      0      0   7.9250        S  Third  woman   True         1
3  female  35.0      1      0  53.1000        S  First  woman  False         1
4    male  35.0      0      0   8.0500        S  Third    man   True         0

In [4]:
df.shape

(891, 10)

In [6]:
df['survived'].value_counts(normalize=True) *100

0    61.616162
1    38.383838
Name: survived, dtype: float64

In [15]:
df.groupby(['sex','survived']).survived.count()

sex     survived
female  0            81
        1           233
male    0           468
        1           109
Name: survived, dtype: int64